{"0": {"phase_name_abb": "PMS", "phase_name": "Pre-Main Sequence", "description": "On the PMS, the star undergoes contraction as it descends the nearly vertical track on the Hertzsprung-Russell diagram known as the Hayashi track. The central density and temperature are not sufficiently high at this stage for hydrogen fusion to take place in the center. All PMS stars start out as fully-convective (energy is transported by large-scale turbulent motions, akin to boiling water) objects, but for those that are more massive than ~0.3 Msun, a radiative region (energy is carried away by photons) develops in the interior as they approach the MS.", "phase_number": "-1"}, "1": {"phase_name_abb": "MS", "phase_name": "Main Sequence", "description": "The MS phase is the longest-lived stage of evolution leading up to the formation of a white dwarf. For the Sun, this is expeced to last ~10 billion years. On the MS, the star steadily fuses hydrogen to helium, which generates thermal energy and provides support against gravity. Hydrogen-fusion occurs primarily via proton-proton chain for stars like the Sun, but in more massive stars, the CNO-cycle dominates. Moreover, this process takes place in a radiative core for stars like the Sun, but for more massive stars, it occurs in a convective core instead. Stars harboring convective cores show a characteristic 'hook' morphology as they leave the MS.", "phase_number": "0"}, "2": {"phase_name_abb": "RGB", "phase_name": "Red Giant Branch", "description": "Once the star runs out of its hydrogen fuel in the center, it can no longer produce enough energy to hold up its own weight. As a result, the helium core begins to contract, releasing gravitational energy in the process. This extra energy is deposited outside the helium core, which heats up the layer and triggers hydrogen fusion in a shell. This so-called shell-burning is accompanied by an expanding, cool, convective outer envelope. The star is now a red giant star and it continues to become brighter and larger at a roughly constant temperature, tracing its path upward the Hayashi track. This phase is expected to last only ~1.5 billion years for the Sun.", "phase_number": "2"}, "3": {"phase_name_abb": "CHeB", "phase_name": "Core Helium Burning", "description": "During the RGB phase, hydrogen shell-burning deposits freshly-fused helium on the inert helium core as it continues to contract, making it both denser and more massive. Eventually, the core becomes massive, dense, and hot enough for the onset of helium fusion. In stars below ~2 Msun, ignition proceeds violently through a phenomenon known as the helium flash: the helium core is so dense that the most central region becomes degenerate, which suffers an unstable, explosive thermonuclear runaway reaction with the sudden ignition of helium. In stars above ~2 Msun, helium ignites in a non-degenerate core and thus proceeds in a quiescent manner. Regardless of the ignition condition, the star leaves the Hayashi track and is no longer a red giant, and helium fusion ensues along with hydrogen shell-burning beyond the core. This phase is expected to last only ~0.1 billion years for the Sun.", "phase_number": "3"}, "4": {"phase_name_abb": "AGB", "phase_name": "Asymptotic Giant Branch", "description": "Eventually, the star runs out of helium fuel in the center. The carbon/oxygen core contracts and the outer layers expand to form an AGB star, analogous to the RGB phase. In stars less massive than ~8 Msun, the core cannot become dense and hot enough for carbon and oxygen to fuse into heavier elements, and the central regions become degenerate. However, the contracting core releases gravitational energy and heats up the layer above the carbon/oxygen core, which sets of helium shell-burning. In turn, helium shell-burning deposits energy in the hydrogen layer above, triggering hydrogen shell-burning as well. Throughout the AGB phase, hydrogen and helium shell-burning alternate, giving rise to the well-known thermal pulses. These pulses are associated with dense winds and a rich array of heavy elements synthesized through successive neutron-captures called the s-process. Eventually, the AGB star sheds its envelope entirely, leaving behind its hot carbon/oxygen core.", "phase_number": "4"}, "5": {"phase_name_abb": "AGB", "phase_name": "Asymptotic Giant Branch", "description": "Eventually, the star runs out of helium fuel in the center. The carbon/oxygen core contracts and the outer layers expand to form an AGB star, analogous to the RGB phase. In stars less massive than ~8 Msun, the core cannot become dense and hot enough for carbon and oxygen to fuse into heavier elements, and the central regions become degenerate. However, the contracting core releases gravitational energy and heats up the layer above the carbon/oxygen core, which sets of helium shell-burning. In turn, helium shell-burning deposits energy in the hydrogen layer above, triggering hydrogen shell-burning as well. Throughout the AGB phase, hydrogen and helium shell-burning alternate, giving rise to the well-known thermal pulses. These pulses are associated with dense winds and a rich array of heavy elements synthesized through successive neutron-captures called the s-process. Eventually, the AGB star sheds its envelope entirely, leaving behind its hot carbon/oxygen core.", "phase_number": "5"}, "6": {"phase_name_abb": "PAGBWD", "phase_name": "Post-Asymptotic Giant Branch + White Dwarf", "description": "At this post-AGB phase, the bare, degenerate core is shrouded deep inside shells of gas it ejected during the AGB phase. The core is hot and thus produces copious amounts of high energy photons that ionize and light up the surrounding gas. Observationally, these objects correspond to planetary nebulae. Though initially very hot, the central object quickly cools and can no longer light up the surrounding gas that is also gradually dispersing into the interstellar medium. The compact, central object that is left behind is now a white dwarf, which is supported against gravity by electron degeneracy pressure. White dwarfs are notable for their incredibly high density: approximately a solar mass's worth of material is packed inside a sphere the size of the Earth.", "phase_number": "6"}}